{
  "anecdotes": [
    {
      "content": "If it hurts, do it more often",
      "id": "47145",
      "votes": 0
    },
    {
      "content": "Adding manpower to a late software project makes it later!",
      "id": "21149",
      "votes": 2
    },
    {
      "content": "The first 90 percent of the code accounts for the first 10 percent of the development time...The remaining 10 percent of the code accounts for the other 90 percent of the development time.",
      "id": "69581",
      "votes": 2
    },
    {
      "content": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
      "id": "36975",
      "votes": 11
    },
    {
      "content": "Premature optimization is the root of all evil.",
      "id": "25170",
      "votes": 1
    },
    {
      "content": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
      "id": "98312",
      "votes": 0
    },
    {
      "id": "739f",
      "content": "There is nothing quite so useless as doing with great efficiency something that should not be done at all.",
      "votes": 1
    },
    {
      "id": "32e0",
      "content": "Walking on water and developing software from a specification are easy if both are frozen.",
      "votes": 0
    },
    {
      "id": "55d9",
      "content": "Programs must be written for people to read, and only incidentally for machines to execute.",
      "votes": 0
    },
    {
      "id": "ee05",
      "content": "Software and cathedrals are much the same: first we build them, then we pray.",
      "votes": 0
    },
    {
      "id": "0908",
      "content": "Writing code is like writing a book, except if you miss out a single comma on page 126 the whole thing makes no sense.",
      "votes": 9
    },
    {
      "id": "15f5",
      "content": "Software development is like building a bridge, except the river is constantly moving, the banks keep shifting, and every morning the users drive trucks twice as heavy as what you designed for.",
      "votes": 1
    },
    {
      "id": "6f49",
      "content": "Computers are like air conditioners: they stop working properly if you open Windows.",
      "votes": 6
    }
  ]
}